---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentClosedEventArgs
source: html/ea150cd4-674d-08a3-ac42-6472966fe4ba.htm
---
# Autodesk.Revit.DB.Events.DocumentClosedEventArgs

The event arguments used by the DocumentClosed event.

## Syntax (C#)
```csharp
public class DocumentClosedEventArgs : RevitAPIPostEventArgs
```